In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Col1': [100, 200, 300],
    'Col2': [400, 500, 600],
    'Col3': [700, 800, 900]
}, index= ['fila1', 'fila2', 'fila3'])

df

       Col1  Col2  Col3
fila1   100   400   700
fila2   200   500   800
fila3   300   600   900

LOC

In [3]:
df.loc['fila1']

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [4]:
type(df.loc['fila1'])

pandas.core.series.Series

In [5]:
df.loc[['fila1', 'fila2']]

       Col1  Col2  Col3
fila1   100   400   700
fila2   200   500   800

In [6]:
type(df.loc[['fila1', 'fila2']])

pandas.core.frame.DataFrame

In [7]:
df.loc['fila2' : 'fila3']

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [ ]:
df.loc[[False, True, False]] #Devuelve solamente la fila 'True'

       Col1  Col2  Col3
fila2   200   500   800

In [9]:
df.loc[df['Col1'] > 150]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [10]:
df.loc[:, ['Col1', 'Col2']]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

ILOC

In [11]:
df.iloc[0]

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [12]:
df.iloc[:, [0,1]]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

In [ ]:
df.iloc[1:3]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

Ejercitacion:

In [14]:
df = pd.DataFrame({
    'Nombre': ['Ana', 'Luis', 'Carmen'],
    'Edad': [25, 30, 22],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia']
}, index=['fila1', 'fila2', 'fila3'])

In [15]:
df

       Nombre  Edad     Ciudad
fila1     Ana    25     Madrid
fila2    Luis    30  Barcelona
fila3  Carmen    22   Valencia

In [16]:
resultado = df.loc['fila2']
resultado

Nombre         Luis
Edad             30
Ciudad    Barcelona
Name: fila2, dtype: object

In [17]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12],
    'D': [13, 14, 15, 16]
})
df

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [18]:
resultado = df.iloc[[0,1], [2,3]]
resultado

    C   D
0   9  13
1  10  14